rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Meh"], ["rating", "G"], ["director", "Meh"], ["release_date", "2016-07-15 00:00:00.000000"], ["created_at", "2016-07-15 21:03:36.776779"], ["updated_at", "2016-07-15 21:03:36.776779"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
    def similar_director
    @id = params[:id]
    @movie = Movie.find(@id)